In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [4]:
s= pd.Series([1,2,3,4,5,6,7,8,9,10], index=['a','b','c','d','e','f','g','h','i','j'])
s

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [5]:
data =  {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [6]:
f = pd.read_excel("Data.xlsx")
f

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [7]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\komal\onedrive\desktop\rohan hw\myenv\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [8]:
f = pd.read_excel("Data.xlsx")
f

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [9]:
f.head()

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [10]:
f.tail()

      Name   Age Department  Salary
0    Alice  25.0         HR   50000
1      Bob  30.0         IT   60000
2  Charlie   NaN    Finance   70000
3    David  40.0         IT   80000
4      Eva  28.0         HR   52000

In [11]:
g =pd.read_csv("Data.csv")
g

      Name  Age Department  Salary
0    Alice   20         HR   50000
1  Charlie   35    Finance   70000
2    David   26         IT   80000
3      Eva   28         HR   52000

In [12]:
g.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        4 non-null      object
 1   Age         4 non-null      int64
 2   Department  4 non-null      object
 3   Salary      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [13]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [14]:
g.columns

Index(['Name', 'Age', 'Department', 'Salary'], dtype='object')

In [15]:
g.dtypes

Name          object
Age            int64
Department    object
Salary         int64
dtype: object

In [16]:
g.shape

(4, 4)

In [17]:
g.size

16

In [18]:
import numpy as np

In [19]:
import pandas as pd

In [20]:
g[["Age","Name"]]

   Age     Name
0   20    Alice
1   35  Charlie
2   26    David
3   28      Eva

In [22]:
g[["Age","Name"]]

   Age     Name
0   20    Alice
1   35  Charlie
2   26    David
3   28      Eva

In [ ]:
g[["Age","Name"]]

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie
3   40    David
4   28      Eva

In [ ]:
g.iloc[0]

Name          Alice
Age              25
Department       HR
Salary        50000
Name: 0, dtype: object

In [ ]:
g.loc[0]

Name          Alice
Age              25
Department       HR
Salary        50000
Name: 0, dtype: object

In [23]:
g[g["Age"]>30]

      Name  Age Department  Salary
1  Charlie   35    Finance   70000

In [ ]:
g[g["Age"]>30]

      Name  Age Department  Salary
2  Charlie   35    Finance   70000
3    David   40         IT   80000

In [ ]:
g["color"] = ["red", "blue", "green", "yellow", "purple"]
g

      Name  Age Department  Salary   color
0    Alice   25         HR   50000     red
1      Bob   30         IT   60000    blue
2  Charlie   35    Finance   70000   green
3    David   40         IT   80000  yellow
4      Eva   28         HR   52000  purple

In [ ]:
g.loc[3,"Age"] = 26
g
g.loc[0,"Age"] = 20
g

      Name  Age Department  Salary   color
0    Alice   20         HR   50000     red
1      Bob   30         IT   60000    blue
2  Charlie   35    Finance   70000   green
3    David   26         IT   80000  yellow
4      Eva   28         HR   52000  purple

In [ ]:
g.drop("color", axis=1, inplace=True)
g

      Name  Age Department  Salary
0    Alice   20         HR   50000
1      Bob   30         IT   60000
2  Charlie   35    Finance   70000
3    David   26         IT   80000
4      Eva   28         HR   52000

In [ ]:
g.drop(1, axis=0, inplace=True)
g

      Name  Age Department  Salary
0    Alice   20         HR   50000
2  Charlie   35    Finance   70000
3    David   26         IT   80000
4      Eva   28         HR   52000

In [ ]:
g.isnull()

    Name    Age  Department  Salary
0  False  False       False   False
2  False  False       False   False
3  False  False       False   False
4  False  False       False   False

In [ ]:
g.isnull().mean()

Name          0.0
Age           0.0
Department    0.0
Salary        0.0
dtype: float64

In [ ]:
f.isnull()

    Name    Age  Department  Salary
0  False  False       False   False
1  False  False       False   False
2  False   True       False   False
3  False  False       False   False
4  False  False       False   False

In [ ]:
f.isnull().mean()
# f.isnull().sum()
# f.isnull().sum().sum()
# f.isnull().any()
# f.isnull().all()
# f.isnull().std

Name          0.0
Age           0.2
Department    0.0
Salary        0.0
dtype: float64

In [ ]:
g.dropna()

      Name  Age Department  Salary
0    Alice   20         HR   50000
2  Charlie   35    Finance   70000
3    David   26         IT   80000
4      Eva   28         HR   52000

In [ ]:
g.fillna(g["Age"].mean())

      Name  Age Department  Salary
0    Alice   20         HR   50000
2  Charlie   35    Finance   70000
3    David   26         IT   80000
4      Eva   28         HR   52000

In [ ]:
f.fillna(g["Age"].mean())

      Name    Age Department  Salary
0    Alice  25.00         HR   50000
1      Bob  30.00         IT   60000
2  Charlie  27.25    Finance   70000
3    David  40.00         IT   80000
4      Eva  28.00         HR   52000

In [ ]:
g.sort_values("Age", ascending=True)

      Name  Age Department  Salary
0    Alice   20         HR   50000
3    David   26         IT   80000
4      Eva   28         HR   52000
2  Charlie   35    Finance   70000

In [ ]:
g.Age

0    20
2    35
3    26
4    28
Name: Age, dtype: int64

In [ ]:
g.to_csv("Data.csv", index=False)